# https://ivtipm.github.io/Programming/Glava01/index01.htm#z10
# Даны целые числа a1,...a50. Получить сумму тех чисел данной последовательности, которые кратные 5
__author__ = "Vlad Karelov"
import numpy as np

def main(a):
    print(f"Array we work with: {a}")
    result = 0
    # for i in range(5,len(a),5):
    #     print(f"Found number: {i}")
    #     result += a[i]
    # return result
    for i in range(len(a)):
        if 

        

data = np.zeros(50, dtype=int)

for i in range(len(data)):
    dummy = np.random.randint(1,10)
    data[i] = dummy

print(main(data))

# переделать проверка a кратности 5
# разбить на функции






